package fp.s105502009;

public class Map1 extends Map{
	
	public Map1(int[][] map) {
		super(map);
	}

	public int[][] initMap(int[][] map) {//-2.-3是會消失的NPC,-1是主角位置,0是可通過,1是障礙,2是上樓梯,3是下樓梯,4是特殊門,5是不會消失的NPC,剩下的數字都是道具
		for(int i=0; i<13; i++) {
			//地圖物件
			map[1][i]=0;   
			map[1][1]=2;    
			map[1][3]=9;   
			map[1][4]=60;    
			map[1][5]=61;   
			map[1][6]=62;  
			map[2][i]=1; 
			map[2][11]=0;  
			map[3][i]=0;  
			map[3][1]=40;    
			map[3][3]=70;   
			map[3][4]=30;   
			map[3][6]=1;  
			map[3][7]=43;  
			map[3][8]=19;   
			map[3][9]=45;    
			map[3][10]=1;      
			map[4][i]=0;   
			map[4][1]=10;
			map[4][2]=71;
			map[4][3]=50;
			map[4][7]=44;
			map[4][8]=18;
			map[4][9]=46;
			map[4][4]=1;
			map[4][6]=1;
			map[4][10]=1;
			map[5][i]=1;
			map[5][2]=31;
			map[5][5]=0; 
			map[5][9]=69;
			map[5][11]=0;
			map[6][i]=0;
			map[6][1]=11;
			map[6][2]=65;
			map[6][4]=1;
			map[6][6]=34;
			map[6][7]=66;
			map[6][8]=67;
			map[6][9]=68;
			map[6][10]=1;
			map[7][i]=1; 
			map[7][1]=51;
			map[7][2]=0;
			map[7][3]=20;
			map[7][5]=0;
			map[7][11]=0;
			map[8][i]=0;
			map[8][1]=1;
			map[8][2]=32;
			map[8][3]=1;
			map[8][4]=1;
			map[9][i]=1;
			map[9][1]=0;
			map[9][2]=64;
			map[9][3]=0;
			map[9][6]=35;
			map[9][10]=33;
			map[10][i]=0;
			map[10][1]=41;
			map[10][2]=47;
			map[10][3]=12;
			map[10][4]=1;
			map[10][5]=22;
			map[10][8]=1;
			map[10][9]=14;
			map[10][10]=63;//63狼
			map[10][11]=21;
			map[11][i]=0;
			map[11][1]=42;
			map[11][2]=-2;
			map[11][4]=1;
			map[11][8]=1;
			map[11][6]=-1;
			map[11][3]=13;
			map[11][9]=15;
			map[11][10]=16;
			map[11][11]=17;
		}
		map = setWill(map);
		
		return map;
	}

}
