package fp.s105502009;

public class Map5 extends Map{
	
	public Map5(int[][] map) {
		super(map);
	}
	
	public int[][] initMap(int[][] map) {//-2.-3是會消失的NPC,-1是主角位置,0是可通過,1是障礙,2是上樓梯,3是下樓梯,4是特殊門,5是不會消失的NPC,剩下的數字都是道具
		for(int i=0; i<13; i++) {
			//牆壁
			map[0][i]=1;
			map[i][0]=1;
			map[12][i]=1;
			map[i][12]=1;
			
			//地圖物件
			map[i][1]=0;
			map[9][1]=1;
			map[3][1]=60;
			map[5][1]=61;
			map[1][1]=13;
			map[6][1]=50;
			map[7][1]=52;
			map[11][1]=3;
			map[i][2]=1;
			map[4][2]=30;
			map[8][2]=5;
			map[10][2]=0;
			map[11][2]=0;
			map[i][3]=0;
			map[7][3]=1;
			map[4][3]=62;
			map[1][3]=40;
			map[2][3]=51;
			map[8][3]=1;
			map[9][3]=1;
			map[10][3]=1;
			map[11][3]=63;
			map[i][4]=0;
			map[1][4]=1;
			map[2][4]=1;
			map[3][4]=1;
			map[7][4]=64;
			map[8][4]=65;
			map[9][4]=66;
			map[4][4]=1;
			map[5][4]=1;
			map[i][5]=0;
			map[2][5]=67;
			map[3][5]=68;
			map[1][5]=41;
			map[4][5]=8;
			map[5][5]=1;
			map[7][5]=1;
			map[8][5]=1;
			map[9][5]=1;
			map[10][5]=1;
			map[i][6]=0;
			map[1][6]=69;
			map[5][6]=1;
			map[4][6]=70;
			map[6][6]=71;
			map[7][6]=1;
			map[9][6]=32;
			map[10][6]=72;
			map[i][7]=1;
			map[1][7]=2;
			map[2][7]=0;
			map[6][7]=73;
			map[8][7]=0;
			map[i][8]=0;
			map[3][8]=1;
			map[10][8]=53;
			map[11][8]=11;
			map[7][8]=1;
			map[9][8]=34;
			map[i][9]=0;
			map[1][9]=74;
			map[4][9]=75;
			map[8][9]=76;
			map[9][9]=1;
			map[3][9]=31;
			map[10][9]=35;
			map[11][9]=1;
			map[i][10]=0;
			map[3][10]=1;
			map[2][10]=77;
			map[4][10]=78;
			map[8][10]=79;
			map[11][10]=7;
			map[9][10]=33;
			map[1][10]=9;
			map[10][10]=42;
			map[i][11]=0;
			map[2][11]=10;
			map[3][11]=1;
			map[4][11]=6;	
			map[9][11]=1;
			map[5][11]=80;
			map[1][11]=12;
			map[10][11]=1;
			map[11][11]=1;
		}
		map = setWill(map);
		return map;
	}
}
